Revit 2027 API
ParameterTypeId.DimLineExtension Property
 "Dimension Line Extension"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimLineExtension { get; }
Public Shared ReadOnly Property DimLineExtension As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimLineExtension {
	ForgeTypeId^ get ();
}
static member DimLineExtension : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace